In [1305]:
## Final Project Submission

#Please fill out:
#* Student name:patrick priestley 
#* Student pace: self paced / part time / full time
#* Scheduled project review date/time: 
#* Instructor name:Joseph Mata
#* Blog post URL:https://flatiron-school.slack.com/archives/C033EDNNA1Z/p1665148267333919

In [27]:
# Your code here - remember to use markdown cells for comments as well!
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [28]:
imdbset = pd.read_csv('/Users/patrickpriestley/Downloads/data.tsv',sep='\t')

In [29]:
print(imdbset.columns)

Index(['nconst', 'primaryName', 'birthYear', 'deathYear', 'primaryProfession',
       'knownForTitles'],
      dtype='object')

In [30]:
imdbset[(imdbset['primaryProfession'] == 'actor') ]

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
281,nm0000282,Scott Bairstow,1970,\N,actor,"tt0119925,tt0120512,tt0182587,tt0283084"
313,nm0000314,Charles Bronson,1921,2003,actor,"tt0057115,tt0071402,tt0054047,tt0064116"
373,nm0000374,Brad Dourif,1950,\N,actor,"tt0167261,tt0099528,tt0073486,tt0095647"
605,nm0000606,Jean Reno,1948,\N,actor,"tt0122690,tt0095250,tt0110413,tt0383216"
668,nm0000669,Fred Thompson,1942,2015,actor,"tt0099423,tt0093640,tt0109190,tt0099810"
...,...,...,...,...,...,...
11972668,nm9993697,Zakariya Ganim,\N,\N,actor,\N
11972669,nm9993698,Sebi John,\N,\N,actor,tt8736744
11972670,nm9993699,Dani Jacob,\N,\N,actor,tt8736744
11972672,nm9993701,Sanjai Kuriakose,\N,\N,actor,tt8736744
11972674,nm9993703,James Craigmyle,\N,\N,actor,"tt6225166,tt11212278,tt10627062,tt6914160"

In [31]:


dftmdb = pd.read_csv('zippedData/tmdb.movies.csv')

In [32]:
dftmdb[dftmdb['vote_average'] >8 ]

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
19,19,"[18, 53, 9648]",11324,en,Shutter Island,18.060,2010-02-18,Shutter Island,8.1,12625
43,43,"[35, 10749]",239,en,Some Like It Hot,14.200,1959-03-18,Some Like It Hot,8.2,1562
58,58,[18],705,en,All About Eve,13.163,2000-10-06,All About Eve,8.2,685
103,103,"[28, 18, 36]",11645,ja,乱,10.885,1985-09-26,Ran,8.1,600
...,...,...,...,...,...,...,...,...,...,...
26287,26287,"[10402, 35, 10770]",541619,en,Teen Choice,0.600,2018-08-12,Teen Choice,8.5,1
26288,26288,[99],507190,en,The Push,0.600,2018-02-09,The Push,8.5,1
26289,26289,[99],506730,en,Neat: The Story of Bourbon,0.600,2018-02-20,Neat: The Story of Bourbon,8.5,2
26290,26290,"[16, 18]",562416,en,Pip,0.600,2018-10-25,Pip,8.3,3
26291,26291,[99],375860,en,The Surrounding Game,0.600,2017-04-03,The Surrounding Game,8.3,3

In [34]:
print(dftmdb.columns)
print(dfbudg.columns)
print(dfreviews.columns)
print(dfmovie_info.columns)

Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

NameError: name 'dfbudg' is not defined

In [ ]:
dftmdb

In [ ]:

#merge data sets 
#clean and convert rowe$ to int

pd.merge(dfreviews, dftmdb, on = "id", how = "outer")

In [ ]:
dfbudg

In [ ]:
dfbudg['release_date'] = pd.to_datetime(dfbudg['release_date'])

In [ ]:
dfbudg['year'] = dfbudg['release_date'].dt.year

In [ ]:
dfbudg['month'] = dfbudg['release_date'].dt.month

In [ ]:
dfbudg.groupby('month').max()['worldwide_gross'].plot(kind = 'bar')

In [ ]:
#find top10 movies by gross y2017
dfbudg[dfbudg['year'] > 2017].sort_values(by = 'worldwide_gross', ascending = False).head(10)

In [ ]:
#find top10 movies by gross y>2017
#clean and convert rowe$ to int

In [ ]:
top10recentmovies= dfbudg[dfbudg['year'] > 2017].sort_values(by = 'worldwide_gross', ascending = False).head(10)

In [ ]:
domestic = (top10recentmovies["domestic_gross"])

In [ ]:


ax = plt.subplots()
 
# plotting columns
ax = sns.barplot(x=top10recentmovies["worldwide_gross"], y=top10recentmovies["movie"], color='b')
ax = sns.barplot(x=top10recentmovies["domestic_gross"], y=top10recentmovies["movie"], color='r')

plt.xlabel("movie")
plt.ylabel("gross in billions")
plt.xticks(rotation=45)

plt.show()

In [ ]:
ax = plt.subplots()
 
# plotting columns
ax = sns.barplot(x=top10recentmovies["worldwide_gross"], y=top10recentmovies["movie"], color='b')
ax = sns.barplot(x=top10recentmovies["domestic_gross"], y=top10recentmovies["movie"], color='r')
ax = sns.barplot(x=top10recentmovies["production_budget"], y=top10recentmovies["movie"], color='g')


plt.xlabel("movie")
plt.ylabel("gross in billions")
plt.xticks(rotation=45)

plt.show()

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
 
dfbudg.groupby('month').max()['worldwide_gross'].plot(kind = 'bar')

# ax.set_xlabel(cmap_category + ' colormaps', fontsize=14)

sns.barplot(dfbudg.groupby('month').max()['worldwide_gross'].index ,dfbudg.groupby('month').max()['worldwide_gross'].values )

In [ ]:
#join budget and votes, looking for coralation $=votes
#convert to df to date time

dftmdb['release_date'] = pd.to_datetime(dftmdb['release_date'])
#dfbudg.dtypes

#cashvote= dftmdb.merge(dfbudg, how = 'left', on = ['release_date'])

In [ ]:
cashvote= dftmdb.merge(dfbudg, how = 'left', on = ['release_date'])
cashvote.dtypes

In [ ]:
dfbudg

In [ ]:
import seaborn as sns


sns.regplot(x=cashvote["production_budget"], y=cashvote["worldwide_gross"])

In [ ]:
cashvote.groupby('vote_count').mean().sort_values(by = 'worldwide_gross', ascending = False).head(20)

In [ ]:
dftmdb.groupby('genre_ids').mean().sort_values(by = 'popularity', ascending = False).head(20)

In [ ]:
dfmovie_info = pd.read_csv('zippedData/rt.movie_info.tsv',sep='\t')

In [ ]:
import sqlite3
lovemv = sqlite3.Connection('zippedData/im.db')

In [ ]:


lovemv, ("""SELECT *  sqlite_master: con=conn,"""),

In [9]:
%%bash 
sqlite3 zippedData/im.db
.schema

CREATE TABLE IF NOT EXISTS "movie_basics" (
"movie_id" TEXT,
  "primary_title" TEXT,
  "original_title" TEXT,
  "start_year" INTEGER,
  "runtime_minutes" REAL,
  "genres" TEXT
);
CREATE TABLE IF NOT EXISTS "directors" (
"movie_id" TEXT,
  "person_id" TEXT
);
CREATE TABLE IF NOT EXISTS "known_for" (
"person_id" TEXT,
  "movie_id" TEXT
);
CREATE TABLE IF NOT EXISTS "movie_akas" (
"movie_id" TEXT,
  "ordering" INTEGER,
  "title" TEXT,
  "region" TEXT,
  "language" TEXT,
  "types" TEXT,
  "attributes" TEXT,
  "is_original_title" REAL
);
CREATE TABLE IF NOT EXISTS "movie_ratings" (
"movie_id" TEXT,
  "averagerating" REAL,
  "numvotes" INTEGER
);
CREATE TABLE IF NOT EXISTS "persons" (
"person_id" TEXT,
  "primary_name" TEXT,
  "birth_year" REAL,
  "death_year" REAL,
  "primary_profession" TEXT
);
CREATE TABLE IF NOT EXISTS "principals" (
"movie_id" TEXT,
  "ordering" INTEGER,
  "person_id" TEXT,
  "category" TEXT,
  "job" TEXT,
  "characters" TEXT
);
CREATE TABLE IF NOT EXISTS "writers" (
"movie_id" TEXT,
  "person_id" TEXT
);

In [10]:
sql_query = """SELECT name FROM sqlite_master  
  WHERE type='table';"""

In [1340]:
sql_query2 = ("""SELECT * FROM movie_basics 

         WHERE persons=  name      ;""")

In [1341]:
pd.read_sql =(sql_query2, conn)

In [1342]:
#dfreviews = pd.read_csv('/zippedData/rt.reviews 4.tsv') #, sep='\t')
dfreviews = pd.read_csv('zippedData/rt.reviews_4.tsv',sep='\t',encoding='windows-1254')

In [1343]:
dfreviews

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

6      678815482
41     700059566
112    417719760
43     608581744
135    335061807
95     426525952
983    216303339
302    213511408
91     220159104
314    324591735
Name: domestic_gross, dtype: int64

In [1345]:
top10recentmovies

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year,month
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,4
41,42,2018-02-16,Black Panther,200000000,700059566,1348258224,2018,2
112,13,2018-06-22,Jurassic World: Fallen Kingdom,170000000,417719760,1305772799,2018,6
43,44,2018-06-15,Incredibles 2,200000000,608581744,1242520711,2018,6
135,36,2018-12-21,Aquaman,160000000,335061807,1146894640,2018,12
95,96,2019-03-08,Captain Marvel,175000000,426525952,1123061550,2019,3
983,84,2018-11-02,Bohemian Rhapsody,55000000,216303339,894985342,2018,11
302,3,2018-10-05,Venom,116000000,213511408,853628605,2018,10
91,92,2018-07-27,Mission: ImpossibleâFallout,178000000,220159104,787456552,2018,7
314,15,2018-05-18,Deadpool 2,110000000,324591735,786680557,2018,5

In [1346]:
top10recentmovies['total_gross']=top10recentmovies['domestic_gross']+top10recentmovies['worldwide_gross']

In [1347]:
top10recentmovies

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year,month,total_gross
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,4,2726949682
41,42,2018-02-16,Black Panther,200000000,700059566,1348258224,2018,2,2048317790
112,13,2018-06-22,Jurassic World: Fallen Kingdom,170000000,417719760,1305772799,2018,6,1723492559
43,44,2018-06-15,Incredibles 2,200000000,608581744,1242520711,2018,6,1851102455
135,36,2018-12-21,Aquaman,160000000,335061807,1146894640,2018,12,1481956447
95,96,2019-03-08,Captain Marvel,175000000,426525952,1123061550,2019,3,1549587502
983,84,2018-11-02,Bohemian Rhapsody,55000000,216303339,894985342,2018,11,1111288681
302,3,2018-10-05,Venom,116000000,213511408,853628605,2018,10,1067140013
91,92,2018-07-27,Mission: ImpossibleâFallout,178000000,220159104,787456552,2018,7,1007615656
314,15,2018-05-18,Deadpool 2,110000000,324591735,786680557,2018,5,1111272292

<bound method NDFrame.pct_change of      id release_date                           movie  production_budget  \
6     7   2018-04-27          Avengers: Infinity War          300000000
41   42   2018-02-16                   Black Panther          200000000
112  13   2018-06-22  Jurassic World: Fallen Kingdom          170000000
43   44   2018-06-15                   Incredibles 2          200000000
135  36   2018-12-21                         Aquaman          160000000
95   96   2019-03-08                  Captain Marvel          175000000
983  84   2018-11-02               Bohemian Rhapsody           55000000
302   3   2018-10-05                           Venom          116000000
91   92   2018-07-27   Mission: ImpossibleâFallout          178000000
314  15   2018-05-18                      Deadpool 2          110000000

     domestic_gross  worldwide_gross  year  month  total_gross
6         678815482       2048134200  2018      4   2726949682
41        700059566       1348258224  2018      2   2048317790
112       417719760       1305772799  2018      6   1723492559
43        608581744       1242520711  2018      6   1851102455
135       335061807       1146894640  2018     12   1481956447
95        426525952       1123061550  2019      3   1549587502
983       216303339        894985342  2018     11   1111288681
302       213511408        853628605  2018     10   1067140013
91        220159104        787456552  2018      7   1007615656
314       324591735        786680557  2018      5   1111272292  >